cmsis-svd/cmsis-svd/data/Fujitsu/MB9AFB4xN.svd
        <!-- REGISTER "ATIM3" -->
        <register derivedFrom="ATIM0">
          <name>ATIM3</name>
          <description>ALE Timing Register 3</description>
          <addressOffset>0x6C</addressOffset>
        </register>
        <!-- REGISTER "ATIM4" -->
        <register derivedFrom="ATIM0">
          <name>ATIM4</name>
          <description>ALE Timing Register 4</description>
          <addressOffset>0x70</addressOffset>
        </register>
        <!-- REGISTER "ATIM5" -->
        <register derivedFrom="ATIM0">
          <name>ATIM5</name>
          <description>ALE Timing Register 5</description>
          <addressOffset>0x74</addressOffset>
        </register>
        <!-- REGISTER "ATIM6" -->
        <register derivedFrom="ATIM0">
          <name>ATIM6</name>
          <description>ALE Timing Register 6</description>
          <addressOffset>0x78</addressOffset>
        </register>
        <!-- REGISTER "ATIM7" -->
        <register derivedFrom="ATIM0">
          <name>ATIM7</name>
          <description>ALE Timing Register 7</description>
          <addressOffset>0x7C</addressOffset>
        </register>
        <!-- REGISTER "DCLKR" -->
        <register>
          <name>DCLKR</name>
          <description>Division Clock Register</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x0000000F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MCLKON" -->
            <field>
              <name>MCLKON</name>
              <description>MCLK ON</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MDIV" -->
            <field>
              <name>MDIV</name>
              <description>MCLK Division Ratio Setup</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "USBCLK" -->
    <peripheral>
      <name>USBCLK</name>
      <description>USB Clock</description>
      <groupName>USBCLK</groupName>
      <baseAddress>0x40036000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x24</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "UCCR" -->
        <register>
          <name>UCCR</name>
          <description>USB Clock Control Register</description>
          <addressOffset>0x00</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UCSEL" -->
            <field>
              <name>UCSEL</name>
              <description>USB clock selection bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UCEN" -->
            <field>
              <name>UCEN</name>
              <description>USB clock output enable bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UPCR1" -->
        <register>
          <name>UPCR1</name>
          <description>USB-PLL Control Register 1</description>
          <addressOffset>0x04</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPINC" -->
            <field>
              <name>UPINC</name>
              <description>USB-PLL input clock selection bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UPLLEN" -->
            <field>
              <name>UPLLEN</name>
              <description>USB-PLL oscillation enable bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UPCR2" -->
        <register>
          <name>UPCR2</name>
          <description>USB-PLL Control Register 2</description>
          <addressOffset>0x08</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x07</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPOWT" -->
            <field>
              <name>UPOWT</name>
              <description>USB-PLL oscillation stabilization wait time setting bit</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UPCR3" -->
        <register>
          <name>UPCR3</name>
          <description>USB-PLL Control Register 3</description>
          <addressOffset>0x0C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPLLK" -->
            <field>
              <name>UPLLK</name>
              <description>Frequency division ratio (K) setting bit of the USB-PLL clock </description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UPCR4" -->
        <register>
          <name>UPCR4</name>
          <description>USB-PLL Control Register 4</description>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x17</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPLLN" -->
            <field>
              <name>UPLLN</name>
              <description>Frequency division ratio (N) setting bit of the USB-PLL clock </description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
